Set up Configuration

In [73]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [ ]:
# ID와 PW를 자신의 환경에 맞게 수정
%sql postgresql://...

'Connected: seankkang@dev'

Example of Running a SQL:  
이후 아래 SQL에서 스키마는 자신의 스키마로 변경

In [ ]:
%%sql

SELECT * FROM raw_data.session_timestamp LIMIT 10

 * postgresql://...
10 rows affected.

[('7cdace91c487558e27ce54df7cdb299c', datetime.datetime(2019, 5, 1, 0, 13, 11, 783000)),
 ('94f192dee566b018e0acf31e1f99a2d9', datetime.datetime(2019, 5, 1, 0, 49, 46, 73000)),
 ('7ed2d3454c5eea71148b11d0c25104ff', datetime.datetime(2019, 5, 1, 10, 18, 43, 210000)),
 ('f1daf122cde863010844459363cd31db', datetime.datetime(2019, 5, 1, 13, 10, 56, 413000)),
 ('fd0efcca272f704a760c3b61dcc70fd0', datetime.datetime(2019, 5, 1, 13, 45, 19, 793000)),
 ('8804f94e16ba5b680e239a554a08f7d2', datetime.datetime(2019, 5, 1, 14, 23, 7, 660000)),
 ('c5f441cd5f43eb2f2c024e1f8b5d00cd', datetime.datetime(2019, 5, 1, 15, 3, 54, 650000)),
 ('d5fcc35c94879a4afad61cacca56192c', datetime.datetime(2019, 5, 1, 15, 13, 16, 140000)),
 ('3d191ef6e236bd1b9bdb9ff4743c47fe', datetime.datetime(2019, 5, 1, 15, 33, 58, 197000)),
 ('c17028c9b6e0c5deaad29665d582284a', datetime.datetime(2019, 5, 1, 15, 59, 57, 490000))]

Example of Converting a SQL result into Pandas Dataframe

In [ ]:
result = %sql SELECT * FROM raw_data.channel
df = result.DataFrame()

 * postgresql://...
7 rows affected.

In [ ]:
df.head()

  channelname
0     Organic
1      Google
2       Naver
3    Facebook
4     Youtube

3주차 과정 첫번째 예제

##### SQL 연습: Channel 테이블 만들어보기

In [ ]:
%%sql
-- SQL 연습: Channel 테이블 만들어보기 - 1
CREATE TABLE IF NOT EXISTS seankkang.test_channel (
   channel varchar(32) primary key
);

 * postgresql://...
Done.

[]

In [ ]:
%%sql
-- SQL 연습: Channel 테이블 만들어보기 - 2
INSERT INTO seankkang.test_channel VALUES ('FACEBOOK'), ('GOOGLE');

 * postgresql://...
2 rows affected.

[]

In [ ]:
%%sql
-- SQL 연습: Channel 테이블 만들어보기 - 3
SELECT * FROM seankkang.test_channel;

 * postgresql://...
4 rows affected.

[('FACEBOOK',), ('GOOGLE',), ('FACEBOOK',), ('GOOGLE',)]

In [ ]:
%%sql
-- SQL 연습: Channel 테이블 만들어보기 - 4
CREATE TABLE seankkang.testsummary AS SELECT TO_CHAR(ts, 'YYYY-MM') AS month, COUNT(DISTINCT userid)
FROM raw_data.user_session_channel A
JOIN raw_data.session_timestamp B ON A.sessionid = B.sessionid
GROUP BY 1
ORDER BY 1 DESC;

 * postgresql://...
Done.

[]

In [ ]:
%%sql

SELECT EXTRACT(HOUR FROM ts) as session, COUNT(1) as cnt
FROM raw_data.session_timestamp
GROUP BY session
ORDER BY cnt DESC;

 * postgresql://...
24 rows affected.

[(15, 15339),
 (16, 14140),
 (14, 13417),
 (17, 10698),
 (13, 9035),
 (18, 7469),
 (19, 5278),
 (20, 3956),
 (12, 3852),
 (21, 3238),
 (22, 2801),
 (23, 2348),
 (0, 1870),
 (11, 1411),
 (1, 1328),
 (2, 1125),
 (10, 870),
 (3, 815),
 (4, 703),
 (5, 611),
 (6, 491),
 (9, 340),
 (7, 236),
 (8, 149)]

In [ ]:
%%sql

SELECT * FROM raw_data.session_transaction LIMIT 10;

 * postgresql://...
10 rows affected.

[('00029153d12ae1c9abe59c17ff2e0895', False, 85),
 ('008909bd27b680698322c750c400e4b1', False, 13),
 ('0107acb41ef20db2289d261d4e34fd38', False, 16),
 ('018544a2c48077d2cc3ce3278ab1e805', False, 39),
 ('020c38173caff02033564200e0288aa9', False, 61),
 ('029591145fad252b28d844d823097400', False, 13),
 ('03190309cbcd7161a426abd4782bdcd2', False, 75),
 ('03a13aa6921aed989b31d92dc73b391a', False, 129),
 ('04215c1ad3aaff3ed175446d2ea3c0f2', False, 99),
 ('049b8c570e6cc662b4a3d7e3c86e236f', False, 24)]

In [ ]:
%%sql

SELECT * FROM seankkang.testsummary;

 * postgresql://...
7 rows affected.

[('2019-10', 763),
 ('2019-09', 639),
 ('2019-07', 623),
 ('2019-06', 459),
 ('2019-05', 281),
 ('2019-11', 721),
 ('2019-08', 662)]

#### SQL 연습: IN & LIKE/ILIKE

In [ ]:
%%sql
-- SQL 연습: IN & LIKE/ILIKE - 1
SELECT COUNT(1)
FROM raw_data.user_session_channel
WHERE channel IN ('Google', 'Facebook');

 * postgresql://...
1 rows affected.

[(33773,)]

In [ ]:
%%sql
-- SQL 연습: IN & LIKE/ILIKE - 2
SELECT COUNT(1)
FROM raw_data.user_session_channel
WHERE channel ILIKE 'google' or channel ILIKE 'facebook';

 * postgresql://...
1 rows affected.

[(33773,)]

In [ ]:
%%sql
-- SQL 연습: IN & LIKE/ILIKE - 3
SELECT DISTINCT channel
FROM raw_data.user_session_channel
WHERE channel ILIKE '%o%'

 * postgresql://...
4 rows affected.

[('Facebook',), ('Youtube',), ('Organic',), ('Google',)]

In [ ]:
%%sql
-- SQL 연습: IN & LIKE/ILIKE - 3
SELECT DISTINCT channel
FROM raw_data.user_session_channel
WHERE channel NOT ILIKE '%o%'

 * postgresql://...
2 rows affected.

[('Naver',), ('Instagram',)]

####  SQL 연습: STRING Functions

In [ ]:
%%sql
-- SQL 연습: STRING Functions
SELECT 
  LEN(channel),
  UPPER(channel),
  LOWER(channel),
  LEFT(channel, 4)
FROM seankkang.test_channel

 * postgresql://...
4 rows affected.

[(8, 'FACEBOOK', 'facebook', 'FACE'),
 (6, 'GOOGLE', 'google', 'GOOG'),
 (8, 'FACEBOOK', 'facebook', 'FACE'),
 (6, 'GOOGLE', 'google', 'GOOG')]

#### SQL 연습: session이 가장 많이 생성되는 시간대?

In [ ]:
%%sql

SELECT EXTRACT(HOUR FROM ts) AS "hour", COUNT(1) AS "count"
FROM raw_data.session_timestamp
GROUP BY 1
ORDER BY 2 DESC
LIMIT 10

 * postgresql://...
10 rows affected.

[(15, 15339),
 (16, 14140),
 (14, 13417),
 (17, 10698),
 (13, 9035),
 (18, 7469),
 (19, 5278),
 (20, 3956),
 (12, 3852),
 (21, 3238)]

####  SQL 연습: raw_data.channel의 채널별 사용자수 세기


| Table | Fields |
|---|---|
| session_timestamp | sessionid (string), ts (timestamp) |
| user_session_channel | userid (integer), sessionid (string), channel (string) |
| session_transaction | sessionid (string), refunded (boolean), amount (integer) |
| channel | channelname (string) |

In [ ]:
%%sql

SELECT channel.channelname AS "channel", COUNT(1) AS "count"
FROM raw_data.channel AS channel
LEFT JOIN raw_data.user_session_channel AS session
ON channel.channelname = session.channel
GROUP BY 1
ORDER BY 2 DESC

 * postgresql://...
7 rows affected.

[('Youtube', 17091),
 ('Google', 16982),
 ('Naver', 16921),
 ('Organic', 16904),
 ('Instagram', 16831),
 ('Facebook', 16791),
 ('TIKTOK', 1)]

#### SQL 연습: 사용자별로 처음 채널과 마지막 채널 알아내기

In [118]:
%%sql
-- 사용자 251번의 시간순으로 봤을 때 첫 번째 채널과 마지막 채널은 무엇인가? 
-- 일단 노가다로

SELECT st.ts, usc.channel 
FROM raw_data.user_session_channel AS usc
JOIN raw_data.session_timestamp AS st
ON usc.sessionid = st.sessionid
WHERE usc.userid = 251
ORDER BY 1
LIMIT 1

 * postgresql://...
1 rows affected.

[(datetime.datetime(2019, 11, 26, 16, 54, 19), 'Google')]

In [164]:
%%sql
-- ROW_NUMBER 이용해서 해보자

SELECT 
  DISTINCT usc.userid, 
  FIRST_VALUE(usc.channel) OVER(PARTITION BY usc.userid ORDER BY st.ts ROWS BETWEEN UNBOUNDED PRECEDING AND UNBOUNDED FOLLOWING),
  LAST_VALUE(usc.channel) OVER(PARTITION BY usc.userid ORDER BY st.ts ROWS BETWEEN UNBOUNDED PRECEDING AND UNBOUNDED FOLLOWING)  
FROM raw_data.user_session_channel AS usc
JOIN raw_data.session_timestamp AS st 
ON usc.sessionid = st.sessionid
-- WHERE usc.userid = 251
ORDER BY 1
LIMIT 10

 * postgresql://...
10 rows affected.

[(27, 'Youtube', 'Instagram'),
 (29, 'Naver', 'Naver'),
 (33, 'Google', 'Youtube'),
 (34, 'Youtube', 'Naver'),
 (36, 'Naver', 'Youtube'),
 (40, 'Youtube', 'Google'),
 (41, 'Facebook', 'Youtube'),
 (44, 'Naver', 'Instagram'),
 (45, 'Youtube', 'Instagram'),
 (59, 'Instagram', 'Instagram')]

---

##  Assignment - 2
#### Gross Revenue가 가장 큰 UserID 10개 찾기
- Gross revenue: Refund 포함한 매출
- 반드시 SQL로 해보기
 
---

 | Table | Fields |
|---|---|
| session_timestamp | sessionid (string), ts (timestamp) |
| user_session_channel | userid (integer), sessionid (string), channel (string) |
| session_transaction | sessionid (string), refunded (boolean), amount (integer) |
| channel | channelname (string) |

In [123]:
%%sql

SELECT usc.userid, SUM(t.amount) gross_revenue
FROM raw_data.user_session_channel usc
JOIN raw_data.session_transaction t
ON usc.sessionid = t.sessionid
GROUP BY 1
ORDER BY 2 DESC
LIMIT 10

 * postgresql://...
10 rows affected.

[(989, 743),
 (772, 556),
 (1615, 506),
 (654, 488),
 (1651, 463),
 (973, 438),
 (262, 422),
 (1099, 421),
 (2682, 414),
 (891, 412)]

---

## Assignment -3

#### 채널별 월 매출액 테이블 만들기 (본인 스키마 밑에 CTAS로 테이블로 만들기)
1. session_timestamp, user_session_channel, channel, session_transaction
테이블들을 사용
2. channel에 있는 모든 채널에 대해 구성해야함 (값이 없는 경우라도)
3. 아래와 같은 필드로 구성
  -  month
  - channel
  - uniqueUsers (총방문 사용자)
  - paidUsers (구매 사용자: refund한 경우도 판매로 고려)
  - conversionRate (구매사용자 / 총방문 사용자)
  - grossRevenue (refund 포함)
  - netRevenue (refund 제외)

In [163]:
%%sql

SELECT 
  TO_CHAR(time.ts, 'YYYY-MM') "month", 
  c.channelname channel, 
  COUNT(DISTINCT usc.userid) uniqueUsers,
  COUNT(DISTINCT CASE WHEN tran.sessionid IS NOT NULL THEN usc.userid END) paidUsers,
  CAST((paidUsers * 100 / uniqueUsers) AS FLOAT) AS conversionRate,
  SUM(tran.amount) grossRevenue,
  SUM(CASE WHEN tran.refunded = false THEN tran.amount END) netRevenue
FROM raw_data.channel c
LEFT JOIN raw_data.user_session_channel usc ON usc.channel = c.channelname
JOIN raw_data.session_timestamp time ON usc.sessionid = time.sessionid
LEFT JOIN raw_data.session_transaction tran ON usc.sessionid = tran.sessionid
GROUP BY 1, 2
ORDER BY 1, 2
-- LIMIT 10

 * postgresql://...
42 rows affected.

[('2019-05', 'Facebook', 247, 14, 5.0, 1199, 997),
 ('2019-05', 'Google', 253, 10, 3.0, 580, 580),
 ('2019-05', 'Instagram', 234, 11, 4.0, 959, 770),
 ('2019-05', 'Naver', 237, 11, 4.0, 867, 844),
 ('2019-05', 'Organic', 238, 17, 7.0, 1846, 1571),
 ('2019-05', 'Youtube', 244, 10, 4.0, 529, 529),
 ('2019-06', 'Facebook', 414, 22, 5.0, 1578, 1578),
 ('2019-06', 'Google', 412, 13, 3.0, 947, 947),
 ('2019-06', 'Instagram', 410, 21, 5.0, 1462, 1418),
 ('2019-06', 'Naver', 398, 15, 3.0, 1090, 1090),
 ('2019-06', 'Organic', 416, 14, 3.0, 1129, 940),
 ('2019-06', 'Youtube', 400, 17, 4.0, 1042, 1042),
 ('2019-07', 'Facebook', 558, 32, 5.0, 2222, 2144),
 ('2019-07', 'Google', 556, 21, 3.0, 1558, 1385),
 ('2019-07', 'Instagram', 567, 25, 4.0, 1896, 1766),
 ('2019-07', 'Naver', 553, 19, 3.0, 1547, 1547),
 ('2019-07', 'Organic', 557, 24, 4.0, 1600, 1600),
 ('2019-07', 'Youtube', 564, 36, 6.0, 2210, 2037),
 ('2019-08', 'Facebook', 611, 18, 2.0, 1009, 1009),
 ('2019-08', 'Google', 610, 28, 4.0, 2210, 1894),
 ('2019-08', 'Instagram', 621, 28, 4.0, 2129, 2001),
 ('2019-08', 'Naver', 626, 22, 3.0, 1829, 1551),
 ('2019-08', 'Organic', 608, 26, 4.0, 1643, 1606),
 ('2019-08', 'Youtube', 614, 18, 2.0, 987, 950),
 ('2019-09', 'Facebook', 597, 27, 4.0, 2270, 2270),
 ('2019-09', 'Google', 599, 25, 4.0, 1872, 1691),
 ('2019-09', 'Instagram', 588, 20, 3.0, 1260, 1122),
 ('2019-09', 'Naver', 592, 21, 3.0, 1996, 1996),
 ('2019-09', 'Organic', 592, 23, 3.0, 1267, 1267),
 ('2019-09', 'Youtube', 588, 15, 2.0, 1301, 1301),
 ('2019-10', 'Facebook', 698, 29, 4.0, 1650, 1641),
 ('2019-10', 'Google', 699, 30, 4.0, 2150, 2098),
 ('2019-10', 'Instagram', 707, 34, 4.0, 2568, 2395),
 ('2019-10', 'Naver', 713, 32, 4.0, 2695, 2695),
 ('2019-10', 'Organic', 709, 31, 4.0, 2762, 2608),
 ('2019-10', 'Youtube', 705, 34, 4.0, 2492, 2319),
 ('2019-11', 'Facebook', 688, 26, 3.0, 1678, 1678),
 ('2019-11', 'Google', 688, 26, 3.0, 2286, 2235),
 ('2019-11', 'Instagram', 669, 25, 3.0, 2116, 2116),
 ('2019-11', 'Naver', 667, 26, 3.0, 2234, 1987),
 ('2019-11', 'Organic', 677, 34, 5.0, 2626, 2255),
 ('2019-11', 'Youtube', 677, 46, 6.0, 3532, 3331)]